# Instructions

### Create a Python connection with SQL database and retrieve the results of the following queries as dataframes:

In [79]:
!pip install pymysql
!pip install sqlalchemy

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pymysql in c:\users\nadine kleine\appdata\roaming\python\python39\site-packages (1.0.2)
Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: sqlalchemy in c:\programdata\anaconda3\lib\site-packages (1.4.32)
Requirement already satisfied: greenlet!=0.4.17 in c:\programdata\anaconda3\lib\site-packages (from sqlalchemy) (1.1.1)

In [80]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

In [81]:
from getpass import getpass

In [82]:
password = getpass()

········

In [83]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [84]:
# Task 1: How many distinct (different) actors' last names are there?

In [85]:
data1 = pd.read_sql_query('SELECT COUNT(DISTINCT last_name) FROM actor', engine)
data1.head()

   COUNT(DISTINCT last_name)
0                        121

In [86]:
# Task 2: Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

In [87]:
query2 = '''SELECT *,
CASE
WHEN DAYNAME(rental_date) = 'Monday' then 'Workday'
WHEN DAYNAME(rental_date) = 'Tuesday' then 'Workday'
WHEN DAYNAME(rental_date) = 'Wednesday' then 'Workday'
WHEN DAYNAME(rental_date) = 'Thursday' then 'Workday'
WHEN DAYNAME(rental_date) = 'Friday' then 'Workday'
WHEN DAYNAME(rental_date) = 'Saturday' then 'Weekend'
WHEN DAYNAME(rental_date) = 'Sunday' then 'Weekend'
ELSE 'No info'
END AS 'day_type', DAYNAME(rental_date) AS 'weekday'
FROM sakila.rental;'''

data2 = pd.read_sql_query(query2, engine)
data2.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,day_type,weekday
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,Workday,Tuesday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,Workday,Tuesday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,Workday,Tuesday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,Workday,Tuesday
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,Workday,Tuesday

In [88]:
# Task 3: Get all films with ARMAGEDDON in the title.

In [106]:
query3 = '''SELECT DISTINCT title
FROM film
WHERE title LIKE '%%ARMAGEDDON%%';'''

data3 = pd.read_sql_query(query3, engine)
data3.count()
data3.head(6)

                   title
0        ARMAGEDDON LOST
1    LADYBUGS ARMAGEDDON
2       METAL ARMAGEDDON
3    MOSQUITO ARMAGEDDON
4  STAGECOACH ARMAGEDDON
5      STEERS ARMAGEDDON

In [91]:
# Task 4: Get 10 the longest films.

In [92]:
query4 = '''SELECT title, length 
FROM sakila.film
ORDER BY length DESC
LIMIT 10;;'''

data4 = pd.read_sql_query(query4, engine)
data4.head(10)

                title  length
0      DARN FORRESTER     185
1        POND SEATTLE     185
2       CHICAGO NORTH     185
3       MUSCLE BRIGHT     185
4        WORST BANGER     185
5         GANGS PRIDE     185
6  SOLDIERS EVOLUTION     185
7           HOME PITY     185
8   SWEET BROTHERHOOD     185
9      CONTROL ANTHEM     185

In [93]:
# Task 5: How many films include Behind the Scenes content?

In [102]:
query5 = '''SELECT COUNT(special_features) as "Behind_the_Scenes_content"
FROM sakila.film
WHERE special_features LIKE "%%Behind the Scenes%%";'''

data5 = pd.read_sql_query(query5, engine)
data5.head()

   Behind_the_Scenes_content
0                        538

In [95]:
# Task 6: Which kind of movies (rating) have a mean duration of more than two hours?

In [96]:
query6 = '''SELECT rating, AVG(length) FROM sakila.film
GROUP BY rating
HAVING AVG(length) > 120
ORDER BY rating ASC;'''

data6 = pd.read_sql_query(query6, engine)
data6.head()

  rating  AVG(length)
0  PG-13     120.4439

In [97]:
# Task 7: Rank films by length (filter out the rows that have nulls or 0s in length column). 
# In your output, only select the columns title, length, and the rank.

In [98]:
query7 = '''SELECT title, length 
FROM sakila.film
WHERE length != 0 AND length IS NOT NULL
ORDER BY length DESC;'''

data7 = pd.read_sql_query(query7, engine)
data7.head()

            title  length
0   CHICAGO NORTH     185
1  CONTROL ANTHEM     185
2  DARN FORRESTER     185
3     GANGS PRIDE     185
4       HOME PITY     185